Revit 2024 API
ParameterTypeId.RbsElecSwitchIdParam Property
 "Switch ID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsElecSwitchIdParam { get; }
Visual Basic
Public Shared ReadOnly Property RbsElecSwitchIdParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsElecSwitchIdParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace